Valar-Systems/MiniSpeedCam/version/r1.1/firmware/platformio/esp32_firmware_platformio/src/main.cpp
            // FRONT fires as a rising echo crosses UP through thr_front (oncoming);
            // REAR fires as a falling echo crosses DOWN through thr_rear (receding).
            const bool cross_up_front  = now_above_front && !prev_above_front;
            const bool cross_down_rear = !now_above_rear && prev_above_rear;

            // Either crossing also reveals direction, independent of whether a
            // photo fires -- recorded once per run for telemetry.
            if (direction == 0) {
              if (cross_up_front) direction = 1;
              else if (cross_down_rear) direction = 2;
            }

            if ((maxSpeed >= photo_speed) && !photo_taken) {  // confirmed speeder, capture once
              bool fire = false;
              if (!prox_enabled) {
                fire = true;  // legacy: first frame past photo_speed
              } else if (cross_up_front) {
                fire = true; plate = "FRONT (oncoming)"; direction = 1;
              } else if (cross_down_rear) {
                fire = true; plate = "REAR (receding)"; direction = 2;
              } else if (peak_mag > 0 &&
                         (int)g_last_peak_mag < (int)((peak_mag * PHOTO_PEAK_DROP_PCT) / 100)) {
                // Past closest approach without a clean crossing: best-effort shot.
                fire = true; plate = "PEAK (fallback)";
                if (direction == 0) direction = 2;  // well past the peak => receding
              }
              if (fire) {
                Serial.printf("[PHOTO] capture: plate=%s speed=%d max=%d mag=%u peak=%u thr_front=%d thr_rear=%d\n",
                              plate, speed, maxSpeed, (unsigned)g_last_peak_mag,
                              (unsigned)peak_mag, thr_front, thr_rear);
                fb = capturePhoto();  // keep the framebuffer; Core 0 returns it after upload
                photo_taken = true;
              }
            }
            prev_above_front = now_above_front;
            prev_above_rear  = now_above_rear;
          }

          delay(100);
        }

        // Echo-energy centroid -> normalized trend (0-100, 50 = symmetric pass).
        // Computed every run for telemetry; also serves as the direction fallback
        // when proximity timing isn't configured and no crossing was observed.
        // Energy weighted toward the END (>0.60) means the echo was still rising
        // -> approaching; toward the START (<0.40) means it was falling ->
        // receding. The 0.40-0.60 dead zone (a symmetric pass) is genuinely
        // ambiguous from magnitude alone, so leave it unknown rather than guess.
        // Need >=3 echoes for the centroid to mean anything.
        uint8_t mag_trend = 255;  // 0-100 normalized centroid; 255 = too few echoes
        if (echo_n >= 3 && mag_wt_sum > 0) {
          double pos  = (double)mag_idx_sum / (double)mag_wt_sum;  // 0 .. echo_n-1
          double frac = pos / (double)(echo_n - 1);                // 0 .. 1
          if (frac < 0.0) frac = 0.0; else if (frac > 1.0) frac = 1.0;
          mag_trend = (uint8_t)(frac * 100.0 + 0.5);
          if (direction == 0) {
            if (frac >= 0.60) direction = 1;       // energy late  -> rising  -> approaching
            else if (frac <= 0.40) direction = 2;  // energy early -> falling -> receding
          }
        }

        // The run has ended, so maxSpeed is final. Hand it to Core 0 as a
        // single upload request. A photo is attached only if a capture
        // actually succeeded; otherwise it uploads speed-only.
        UploadRequest req;
        req.speed_actual = maxSpeed;
        req.has_photo = (fb != nullptr);
        req.fb = fb;
        req.direction = (uint8_t)direction;
        req.mag_trend = mag_trend;
        req.peak_mag = peak_mag;
        req.peak_snr = peak_snr;
        req.frame_count = sample_count;
        req.duration_ms = millis() - run_start;
        req.mean_speed_x10 =
            sample_count ? (uint16_t)((speed_sum * 10) / sample_count) : 0;
        Serial.printf("[RUN] end: maxSpeed=%d dir=%u trend=%u meanx10=%u frames=%u dur=%lums peak_mag=%u peak_snr=%u has_photo=%d -> enqueue\n",
                      maxSpeed, (unsigned)req.direction, (unsigned)req.mag_trend,
                      (unsigned)req.mean_speed_x10, (unsigned)req.frame_count,
                      (unsigned long)req.duration_ms, (unsigned)req.peak_mag,
                      (unsigned)req.peak_snr, (int)req.has_photo);
        if (xQueueSend(uploadQueue, &req, 0) != pdTRUE) {
          Serial.println("[RUN] upload queue FULL, dropping event");
          if (fb != nullptr) {
            esp_camera_fb_return(fb);  // avoid leaking the framebuffer
          }
        }

        g_run_active = false;  // pass over; Core 0's auto-update service may act again
        previousMillis = millis();
      }
    }

    // Processes the WiFi reset button. Clears Wifi data if pressed for 3 seconds
    wifiResetButton();

    delay(100);
  }
}

/**
 * Core 0 task: networking I/O.
 *
 * Kept off Core 1 so the relatively slow HTTPS upload (and any WiFi
 * reconnect retries) never delays the radar polling loop. Blocks on
 * uploadQueue for finished-run events from Core 1 (no busy polling); the
 * short receive timeout also lets it service proactive WiFi reconnects
 * requested via connect_wifi.
 */
void taskCore0(void* parameter) {
  // Periodic telemetry heartbeat. sendLocalIP() carries the device-health
  // snapshot (RSSI, heap + low-water mark, uptime, reset reason, rejection
  // counters), so it must be re-sent on an interval -- the once-at-boot call in
  // setup() reports those runtime fields while they're still ~0. It self-guards
  // on STA + connected, so it's a no-op in AP/config mode or while asleep.
  const unsigned long HEARTBEAT_INTERVAL_MS = 10UL * 60UL * 1000UL;  // 10 min: fewer WiFi-TX bursts -> less battery drain (and radar interference)
  unsigned long lastHeartbeat = millis();

  while (1) {

    UploadRequest req;
    if (xQueueReceive(uploadQueue, &req, pdMS_TO_TICKS(200)) == pdTRUE) {
      Serial.printf("[UPLOAD] dequeued event: speed=%d has_photo=%d\n", req.speed_actual, (int)req.has_photo);
      sendUpload(req);
      if (req.fb != nullptr) {
        esp_camera_fb_return(req.fb);  // release the framebuffer Core 1 captured
      }
    }

    if (connect_wifi == true) {
      Serial.println("[WIFI] reconnect requested");
      connectWifi();
      connect_wifi = false;
    }

    if (millis() - lastHeartbeat >= HEARTBEAT_INTERVAL_MS) {
      lastHeartbeat = millis();
      sendLocalIP();  // telemetry heartbeat (no-op unless STA + connected)
    }

    serviceRegistration();  // trust-on-first-use device registration (retries w/ backoff until 200)
    otaHealthService();  // commit-or-revert a freshly-applied ESP image once it proves healthy
    otaAutoService();    // poll GitHub on a timer and auto-apply newer firmware while idle
  }
}
